

# Laboratorul 4
---

Importarea librariilor

In [5]:
import pandas_datareader.data as web
import datetime
import pandas as pd

In [16]:
dataset = pd.read_csv('https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/examples/tips.csv')
print(dataset)

     total_bill   tip smoker   day    time  size
0         16.99  1.01     No   Sun  Dinner     2
1         10.34  1.66     No   Sun  Dinner     3
2         21.01  3.50     No   Sun  Dinner     3
3         23.68  3.31     No   Sun  Dinner     2
4         24.59  3.61     No   Sun  Dinner     4
..          ...   ...    ...   ...     ...   ...
239       29.03  5.92     No   Sat  Dinner     3
240       27.18  2.00    Yes   Sat  Dinner     2
241       22.67  2.00    Yes   Sat  Dinner     2
242       17.82  1.75     No   Sat  Dinner     2
243       18.78  3.00     No  Thur  Dinner     2

[244 rows x 6 columns]

In [22]:
s1 = pd.Series(dataset['total_bill'])
s2 = pd.Series(dataset['tip'])

In [29]:
print(f'Analiza statistica pentru Seria 1 :\n\n{s1.describe()}')
print(f'\n\nAnaliza statistica pentru Seria 2 :\n\n{s2.describe()}')

Analiza statistica pentru Seria 1 :

count    244.000000
mean      19.785943
std        8.902412
min        3.070000
25%       13.347500
50%       17.795000
75%       24.127500
max       50.810000
Name: total_bill, dtype: float64


Analiza statistica pentru Seria 2 :

count    244.000000
mean       2.998279
std        1.383638
min        1.000000
25%        2.000000
50%        2.900000
75%        3.562500
max       10.000000
Name: tip, dtype: float64

In [36]:
chunks = pd.read_csv("https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/examples/tips.csv", chunksize=100)

In [37]:
for i, c in enumerate(chunks):
    print(f'Statistica pt partea {i} avand num el {len(c)} :\n{c.describe()}\n')

Statistica pt partea 0 avand num el 100 :
       total_bill         tip        size
count  100.000000  100.000000  100.000000
mean    19.616700    3.059000    2.520000
std      7.917297    1.287689    0.822413
min      3.070000    1.000000    1.000000
25%     14.817500    2.007500    2.000000
50%     18.160000    3.000000    2.000000
75%     22.990000    3.602500    3.000000
max     48.270000    7.580000    4.000000

Statistica pt partea 1 avand num el 100 :
       total_bill         tip        size
count  100.000000  100.000000  100.000000
mean    19.994700    3.010800    2.620000
std      9.838204    1.414453    1.098943
min      7.250000    1.000000    1.000000
25%     13.152500    2.000000    2.000000
50%     17.285000    2.585000    2.000000
75%     24.190000    3.820000    3.000000
max     50.810000   10.000000    6.000000

Statistica pt partea 2 avand num el 44 :
       total_bill        tip       size
count   44.000000  44.000000  44.000000
mean    19.696136   2.831818   2.568182
std      8.974092   1.535516   0.873318
min      7.740000   1.000000   1.000000
25%     12.865000   2.000000   2.000000
50%     16.435000   2.500000   2.000000
75%     26.065000   3.125000   3.000000
max     48.330000   9.000000   5.000000

In [39]:
dataset.groupby('day').agg({"total_bill": ['min', 'max', 'sum', 'mean', 'median', 'std', 'var']} )

     total_bill
            min    max      sum       mean median       std        var
day
Fri        5.75  40.17   325.88  17.151579  15.38  8.302660  68.934158
Sat        3.07  50.81  1778.40  20.441379  18.24  9.480419  89.878338
Sun        7.25  48.17  1627.16  21.410000  19.63  8.832122  78.006376
Thur       7.51  43.11  1096.33  17.682742  16.20  7.886170  62.191683

In [40]:
dataset.groupby('day').agg({"tip": ['min', 'max', 'sum', 'mean', 'median', 'std', 'var']} )

       tip
       min    max     sum      mean median       std       var
day
Fri   1.00   4.73   51.96  2.734737  3.000  1.019577  1.039537
Sat   1.00  10.00  260.40  2.993103  2.750  1.631014  2.660208
Sun   1.01   6.50  247.39  3.255132  3.150  1.234880  1.524929
Thur  1.25   6.70  171.83  2.771452  2.305  1.240223  1.538154

In [45]:
dataset.loc[dataset['size'] == 3].groupby('day').agg( {"total_bill": ['min', 'max']} )

     total_bill
            min    max
day
Fri       15.98  15.98
Sat       15.69  50.81
Sun       10.33  45.35
Thur      16.47  22.82

In [ ]:
dataset

In [149]:
std_day = dataset.groupby('day').agg( {"tip": ['std', 'mean']} )
std_day

           tip
           std      mean
day
Fri   1.019577  2.734737
Sat   1.631014  2.993103
Sun   1.234880  3.255132
Thur  1.240223  2.771452

In [150]:
std_day = dataset.groupby('day').agg( {"tip": ['std', 'mean']} )

for r in std_day.iterrows():
    ziua = r[0]
    media = r[1].values[1]
    dev = r[1].values[0]

    print(f"{ziua} -> {dataset.loc[dataset['day'] == ziua].tip.apply(lambda x: x > media + dev).agg([sum]).values[0]}")

Fri -> 3
Sat -> 10
Sun -> 14
Thur -> 9

       year  month  day gender  births
0      1969      1  1.0      F    4046
1      1969      1  1.0      M    4440
2      1969      1  2.0      F    4454
3      1969      1  2.0      M    4548
4      1969      1  3.0      F    4548
...     ...    ...  ...    ...     ...
15542  2008     10  NaN      M  183219
15543  2008     11  NaN      F  158939
15544  2008     11  NaN      M  165468
15545  2008     12  NaN      F  173215
15546  2008     12  NaN      M  181235

[15547 rows x 5 columns]

In [192]:
data = pd.read_csv('https://raw.githubusercontent.com/jakevdp/data-CDCbirths/master/births.csv')

months_str = [ m[:3] for m in [ 'January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December'] ]
data.month = data.month.apply(lambda x: months_str[x-1])

data

       year month  day gender  births
0      1969   Jan  1.0      F    4046
1      1969   Jan  1.0      M    4440
2      1969   Jan  2.0      F    4454
3      1969   Jan  2.0      M    4548
4      1969   Jan  3.0      F    4548
...     ...   ...  ...    ...     ...
15542  2008   Oct  NaN      M  183219
15543  2008   Nov  NaN      F  158939
15544  2008   Nov  NaN      M  165468
15545  2008   Dec  NaN      F  173215
15546  2008   Dec  NaN      M  181235

[15547 rows x 5 columns]

In [176]:
data

       year month  day gender  births
0      1969   Jan  1.0      F    4046
1      1969   Jan  1.0      M    4440
2      1969   Jan  2.0      F    4454
3      1969   Jan  2.0      M    4548
4      1969   Jan  3.0      F    4548
...     ...   ...  ...    ...     ...
15542  2008   Oct  NaN      M  183219
15543  2008   Nov  NaN      F  158939
15544  2008   Nov  NaN      M  165468
15545  2008   Dec  NaN      F  173215
15546  2008   Dec  NaN      M  181235

[15547 rows x 5 columns]

In [183]:
pivot_sum = data.pivot_table('births', columns='month', aggfunc='sum')
pivot_sum

month        Apr       Aug       Dec  ...       Nov       Oct       Sep
births  12085891  13528007  12656915  ...  12197967  12954950  13252831

[1 rows x 12 columns]

In [178]:
pivot_mean = data.pivot_table('births', columns='month', aggfunc='mean')
pivot_mean

month           Apr           Aug  ...          Oct           Sep
births  9390.746698  10334.611917  ...  9904.396024  10289.465062

[1 rows x 12 columns]

In [188]:
pivot_zile = data.pivot_table('births', columns='day', aggfunc='sum')
pivot_zile

day        1.0      2.0      3.0      4.0   ...     29.0     30.0     31.0  99.0
births  2286854  2303168  2309087  2286588  ...  2189278  2141788  1342126  6403

[1 rows x 32 columns]

In [190]:
years = data.groupby('year')
years